Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
# data series

arr = np.array([10,20,30,40,50])

ds = pd.Series(arr)
print(ds)
print('''ds[1] : ''',ds[1])
ds = pd.Series(arr, index=["A","B","C","D","E"])
print(ds)
print('''ds["C"] : ''', ds["C"])

print()
data = {"alice" : 10, "bob" : 20, "charlie" : 30}
ds = pd.Series(data)
print(ds)

0    10
1    20
2    30
3    40
4    50
dtype: int64
ds[1] :  20
A    10
B    20
C    30
D    40
E    50
dtype: int64
ds["C"] :  30

alice      10
bob        20
charlie    30
dtype: int64

In [3]:
# data Frame

data = {
    "Name" : ["Alice", "Bob", "Charlie"],
    "Age" : [18, 20, 22],
    "City" : ["New York", "London", "Sapin"]
}

df = pd.DataFrame(data)
df

      Name  Age      City
0    Alice   18  New York
1      Bob   20    London
2  Charlie   22     Sapin

In [4]:
print(df.loc[0]) # it returns series
print()
print(df.loc[[0,1]])

Name       Alice
Age           18
City    New York
Name: 0, dtype: object

    Name  Age      City
0  Alice   18  New York
1    Bob   20    London

In [5]:
df.describe()

        Age
count   3.0
mean   20.0
std     2.0
min    18.0
25%    19.0
50%    20.0
75%    21.0
max    22.0

In [6]:
# read csv
df = pd.read_excel('C:/Users/admin/OneDrive/Temp/test.xlsx')
print(df)

      Name  Age      City
0    Alice   18  New York
1      Bob   20    London
2  Charlie   22   Toronto

In [7]:
df = pd.read_excel('sample_random_data.xlsx') # read excel
df[['Name','Age']]

        Name  Age
0   Person_1   56
1   Person_2   46
2   Person_3   32
3   Person_4   25
4   Person_5   38
5   Person_6   56
6   Person_7   36
7   Person_8   40
8   Person_9   28
9  Person_10   28

In [8]:
print(pd.options.display.max_rows) #  show maximum no. rows printing

#pd.options.display.max_rows = 60
df.head()

60

   ID      Name  Age    City  Salary Joining Date
0   1  Person_1   56  Sydney   83707   2020-01-31
1   2  Person_2   46   Tokyo  115305   2020-02-29
2   3  Person_3   32  Mumbai   58693   2020-03-31
3   4  Person_4   25  Sydney  101932   2020-04-30
4   5  Person_5   38  London   55658   2020-05-31

In [9]:
df = pd.read_json('sample_random_data.json') # read json
print(df.head(10)) # show first 5 records, .head(10) shows first 10 records

   user_id username                email          signup_date  active  score
0        1   user_1   user_1@example.com  2023-11-18 00:00:00    True  19.97
1        2   user_2   user_2@example.com  2023-07-21 00:00:00    True  59.24
2        3   user_3   user_3@example.com  2022-05-11 00:00:00   False  60.75
3        4   user_4   user_4@example.com  2022-01-21 00:00:00   False   6.51
4        5   user_5   user_5@example.com  2023-01-23 00:00:00   False  96.56
5        6   user_6   user_6@example.com  2022-08-30 00:00:00    True  30.46
6        7   user_7   user_7@example.com  2023-07-19 00:00:00    True  68.42
7        8   user_8   user_8@example.com  2023-01-02 00:00:00    True  12.20
8        9   user_9   user_9@example.com  2023-05-24 00:00:00    True   3.44
9       10  user_10  user_10@example.com  2022-07-25 00:00:00   False  25.88

In [10]:
df.tail() # show last 5 record 
# if .tail(-3) : it show records after 3rd row

   user_id username                email          signup_date  active  score
5        6   user_6   user_6@example.com  2022-08-30 00:00:00    True  30.46
6        7   user_7   user_7@example.com  2023-07-19 00:00:00    True  68.42
7        8   user_8   user_8@example.com  2023-01-02 00:00:00    True  12.20
8        9   user_9   user_9@example.com  2023-05-24 00:00:00    True   3.44
9       10  user_10  user_10@example.com  2022-07-25 00:00:00   False  25.88

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   user_id      10 non-null     int64
 1   username     10 non-null     object
 2   email        10 non-null     object
 3   signup_date  10 non-null     object
 4   active       10 non-null     bool
 5   score        10 non-null     float64
dtypes: bool(1), float64(1), int64(1), object(3)
memory usage: 542.0+ bytes